app/models/templates/fed_ex_tracking_request_template.xml.erb

<?xml version="1.0"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:m0="http://fedex.com/ws/track/v12">
  <SOAP-ENV:Body>
    <TrackRequest xmlns="http://fedex.com/ws/track/v12">
      <WebAuthenticationDetail>
        <UserCredential>
          <Key><%= developer_key %></Key>
          <Password><%= developer_password %></Password>
        </UserCredential>
      </WebAuthenticationDetail>
      <ClientDetail>
        <AccountNumber><%= account_number %></AccountNumber>
        <MeterNumber><%= meter_number %></MeterNumber>
      </ClientDetail>
      <Version>
        <ServiceId>trck</ServiceId>
        <Major>12</Major>
        <Intermediate>0</Intermediate>
        <Minor>0</Minor>
      </Version>
      <SelectionDetails>
        <PackageIdentifier>
          <Type>TRACKING_NUMBER_OR_DOORTAG</Type>
          <Value><%= awb %></Value>
        </PackageIdentifier>
      </SelectionDetails>
    </TrackRequest>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
